





# Дан массив положительных чисел, необходимо сделать
# так, чтобы все 0 переместились в конец но 
# порядок чисел оставался таким же

# [1, 8, 0, 3, 0] -> [1, 8, 3, 0, 0]
# [1, 8, 0, 0, 3] -> [1, 8, 3, 0, 0]

arr = [1, 8, 0, 0, 3]
l = -1

for i in range(len(arr)): # O(n)
    if arr[i] == 0 and l == -1:
        l = i
    elif arr[i] and l != -1:
        arr[l] += arr[i]
        arr[i] = 0
        l += 1

print(arr)

# Скорость: O(n)
# Память: O(1)
        


